vapix/onvif-request/app/initial-info-request/getMetadataConfigurations.xml

<!-- Enpoint: /vapix/services -->

<!-- Request: GetMetadataConfigurations -->

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope">
    <Header/>
    <Body >
        <GetMetadataConfigurations xmlns="http://www.onvif.org/ver20/media/wsdl" />
    </Body>
</Envelope>

<!-- Response: GetMetadataConfigurationsResponse -->

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:tns1="http://www.onvif.org/ver10/topics"
    xmlns:tnsaxis="http://www.axis.com/2009/event/topics"
    xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
    xmlns:tr2="http://www.onvif.org/ver20/media/wsdl"
    xmlns:axt="http://www.onvif.org/ver20/analytics"
    xmlns:ter="http://www.onvif.org/ver10/error">
    <SOAP-ENV:Header></SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <tr2:GetMetadataConfigurationsResponse>
            <tr2:Configurations token="0">
                <tt:Name>user0</tt:Name>
                <tt:UseCount>0</tt:UseCount>
                <tt:PTZStatus>
                    <tt:Status>false</tt:Status>
                    <tt:Position>false</tt:Position>
                </tt:PTZStatus>
                <tt:Analytics>false</tt:Analytics>
                <tt:Multicast>
                    <tt:Address>
                        <tt:Type>IPv4</tt:Type>
                        <tt:IPv4Address>0.0.0.0</tt:IPv4Address>
                    </tt:Address>
                    <tt:Port>0</tt:Port>
                    <tt:TTL>5</tt:TTL>
                    <tt:AutoStart>false</tt:AutoStart>
                </tt:Multicast>
                <tt:SessionTimeout>PT60S</tt:SessionTimeout>
            </tr2:Configurations>
            <tr2:Configurations token="1">
                <tt:Name>user1</tt:Name>
                <tt:UseCount>0</tt:UseCount>
                <tt:PTZStatus>
                    <tt:Status>false</tt:Status>
                    <tt:Position>false</tt:Position>
                </tt:PTZStatus>
                <tt:Analytics>false</tt:Analytics>
                <tt:Multicast>
                    <tt:Address>
                        <tt:Type>IPv4</tt:Type>
                        <tt:IPv4Address>0.0.0.0</tt:IPv4Address>
                    </tt:Address>
                    <tt:Port>0</tt:Port>
                    <tt:TTL>5</tt:TTL>
                    <tt:AutoStart>false</tt:AutoStart>
                </tt:Multicast>
                <tt:SessionTimeout>PT60S</tt:SessionTimeout>
            </tr2:Configurations>
            <tr2:Configurations token="2">
                <tt:Name>user2</tt:Name>
                <tt:UseCount>0</tt:UseCount>
                <tt:PTZStatus>
                    <tt:Status>false</tt:Status>
                    <tt:Position>false</tt:Position>
                </tt:PTZStatus>
                <tt:Analytics>false</tt:Analytics>
                <tt:Multicast>
                    <tt:Address>
                        <tt:Type>IPv4</tt:Type>
                        <tt:IPv4Address>0.0.0.0</tt:IPv4Address>
                    </tt:Address>
                    <tt:Port>0</tt:Port>
                    <tt:TTL>5</tt:TTL>
                    <tt:AutoStart>false</tt:AutoStart>
                </tt:Multicast>
                <tt:SessionTimeout>PT60S</tt:SessionTimeout>
            </tr2:Configurations>
            <tr2:Configurations token="3">
                <tt:Name>user3</tt:Name>
                <tt:UseCount>0</tt:UseCount>
                <tt:PTZStatus>
                    <tt:Status>false</tt:Status>
                    <tt:Position>false</tt:Position>
                </tt:PTZStatus>
                <tt:Analytics>false</tt:Analytics>
                <tt:Multicast>
                    <tt:Address>
                        <tt:Type>IPv4</tt:Type>
                        <tt:IPv4Address>0.0.0.0</tt:IPv4Address>
                    </tt:Address>
                    <tt:Port>0</tt:Port>
                    <tt:TTL>5</tt:TTL>
                    <tt:AutoStart>false</tt:AutoStart>
                </tt:Multicast>
                <tt:SessionTimeout>PT60S</tt:SessionTimeout>
            </tr2:Configurations>
            <tr2:Configurations token="4">
                <tt:Name>user4</tt:Name>
                <tt:UseCount>0</tt:UseCount>
                <tt:PTZStatus>
                    <tt:Status>false</tt:Status>
                    <tt:Position>false</tt:Position>
                </tt:PTZStatus>
                <tt:Analytics>false</tt:Analytics>
                <tt:Multicast>
                    <tt:Address>
                        <tt:Type>IPv4</tt:Type>
                        <tt:IPv4Address>0.0.0.0</tt:IPv4Address>
                    </tt:Address>
                    <tt:Port>0</tt:Port>
                    <tt:TTL>5</tt:TTL>
                    <tt:AutoStart>false</tt:AutoStart>
                </tt:Multicast>
                <tt:SessionTimeout>PT60S</tt:SessionTimeout>
            </tr2:Configurations>
            <tr2:Configurations token="5">
                <tt:Name>user5</tt:Name>
                <tt:UseCount>0</tt:UseCount>
                <tt:PTZStatus>
                    <tt:Status>false</tt:Status>
                    <tt:Position>false</tt:Position>
                </tt:PTZStatus>
                <tt:Analytics>false</tt:Analytics>
                <tt:Multicast>
                    <tt:Address>
                        <tt:Type>IPv4</tt:Type>
                        <tt:IPv4Address>0.0.0.0</tt:IPv4Address>
                    </tt:Address>
                    <tt:Port>0</tt:Port>
                    <tt:TTL>5</tt:TTL>
                    <tt:AutoStart>false</tt:AutoStart>
                </tt:Multicast>
                <tt:SessionTimeout>PT60S</tt:SessionTimeout>
            </tr2:Configurations>
            <tr2:Configurations token="6">
                <tt:Name>user6</tt:Name>
                <tt:UseCount>0</tt:UseCount>
                <tt:PTZStatus>
                    <tt:Status>false</tt:Status>
                    <tt:Position>false</tt:Position>
                </tt:PTZStatus>
                <tt:Analytics>false</tt:Analytics>
                <tt:Multicast>
                    <tt:Address>
                        <tt:Type>IPv4</tt:Type>
                        <tt:IPv4Address>0.0.0.0</tt:IPv4Address>
                    </tt:Address>
                    <tt:Port>0</tt:Port>
                    <tt:TTL>5</tt:TTL>
                    <tt:AutoStart>false</tt:AutoStart>
                </tt:Multicast>
                <tt:SessionTimeout>PT60S</tt:SessionTimeout>
            </tr2:Configurations>
            <tr2:Configurations token="7">
                <tt:Name>user7</tt:Name>
                <tt:UseCount>0</tt:UseCount>
                <tt:PTZStatus>
                    <tt:Status>false</tt:Status>
                    <tt:Position>false</tt:Position>
                </tt:PTZStatus>
                <tt:Analytics>false</tt:Analytics>
                <tt:Multicast>
                    <tt:Address>
                        <tt:Type>IPv4</tt:Type>
                        <tt:IPv4Address>0.0.0.0</tt:IPv4Address>
                    </tt:Address>
                    <tt:Port>0</tt:Port>
                    <tt:TTL>5</tt:TTL>
                    <tt:AutoStart>false</tt:AutoStart>
                </tt:Multicast>
                <tt:SessionTimeout>PT60S</tt:SessionTimeout>
            </tr2:Configurations>
        </tr2:GetMetadataConfigurationsResponse>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>